Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/1.0.64/edc/PIC32MZ2025DAR176.PIC
      <edc:SFRDef edc:_addr="0x1F8E205C" edc:_begin="0x40" edc:_end="0x6c" edc:_modsrc="DOS-EIP-00206r5-sqi-v2.Module" edc:_refcount="2" edc:access="--nnnnnnnnnnnnnn--nnnnnnnnnnnnnn" edc:cname="SQI1TAPCON" edc:desc="SQI Tap Control Register" edc:impl="0x3fff3fff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuuuuuuuuuu--00000000000000" edc:name="SQI1TAPCON" edc:nzwidth="32" edc:por="--xxxxxxxxxxxxxx--00000000000000" ltx:memberofperipheral="SQI1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CLKOUTDLY" edc:desc="SQI Clock Output Delay bits" edc:mask="0xf" edc:name="CLKOUTDLY" edc:nzwidth="0x4">
              <edc:SFRFieldSemantic edc:desc="16 taps added on clock output" edc:when="(field &amp; 0xf) == 0xf"/>
              <edc:SFRFieldSemantic edc:desc="15 taps added on clock output" edc:when="(field &amp; 0xf) == 0xe"/>
              <edc:SFRFieldSemantic edc:desc="2 taps added on clock output" edc:when="(field &amp; 0xf) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="1 tap added on clock output" edc:when="(field &amp; 0xf) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DATAOUTDLY" edc:desc="SQI Data Output Delay bits" edc:mask="0xf" edc:name="DATAOUTDLY" edc:nzwidth="0x4">
              <edc:SFRFieldSemantic edc:desc="16 taps added on clock output" edc:when="(field &amp; 0xf) == 0xf"/>
              <edc:SFRFieldSemantic edc:desc="15 taps added on clock output" edc:when="(field &amp; 0xf) == 0xe"/>
              <edc:SFRFieldSemantic edc:desc="2 taps added on clock output" edc:when="(field &amp; 0xf) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="1 tap added on clock output" edc:when="(field &amp; 0xf) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SDRCLKINDLY" edc:desc="SQI Clock Input Delay bits" edc:mask="0x3f" edc:name="SDRCLKINDLY" edc:nzwidth="0x6">
              <edc:SFRFieldSemantic edc:desc="64 taps added on clock input" edc:when="(field &amp; 0x3f) == 0x3f"/>
              <edc:SFRFieldSemantic edc:desc="63 taps added on clock input" edc:when="(field &amp; 0x3f) == 0x3e"/>
              <edc:SFRFieldSemantic edc:desc="2 taps added on clock input" edc:when="(field &amp; 0x3f) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="1 tap added on clock input" edc:when="(field &amp; 0x3f) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="DDRDATINDLY" edc:mask="0xf" edc:name="DDRDATINDLY" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="SDRDATINDLY" edc:mask="0xf" edc:name="SDRDATINDLY" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="DDRCLKINDLY" edc:mask="0x3f" edc:name="DDRCLKINDLY" edc:nzwidth="0x6"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8E2060" edc:_begin="0x40" edc:_end="0x6c" edc:_modsrc="DOS-EIP-00206r5-sqi-v2.Module" edc:_refcount="2" edc:access="-----------nnnnnnnnnnnnnnnnnnnnn" edc:cname="SQI1MEMSTAT" edc:desc="SQI Memory Status Register" edc:impl="0x1fffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----------000000000000000000000" edc:name="SQI1MEMSTAT" edc:nzwidth="32" edc:por="-----------000000000000000000000" ltx:memberofperipheral="SQI1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="STATCMD" edc:desc="Status Command bits. The status check command is written into these bits." edc:mask="0xffff" edc:name="STATCMD" edc:nzwidth="16"/>
            <edc:SFRFieldDef edc:cname="STATBYTES" edc:desc="Number of Status Bytes bits" edc:mask="0x3" edc:name="STATBYTES" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:desc="Reserved" edc:when="(field &amp; 0x3) == 0x3"/>
              <edc:SFRFieldSemantic edc:desc="Status command/read is 2 bytes long" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:desc="Status command/read is 1 byte long" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="Reserved" edc:when="(field &amp; 0x3) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="STATTYPE" edc:desc="Status Command/Read Lane Mode bits" edc:mask="0x3" edc:name="STATTYPE" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:desc="Reserved" edc:when="(field &amp; 0x3) == 0x3"/>
              <edc:SFRFieldSemantic edc:desc="Status command and read are executed in Quad Lane mode" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:desc="Status command and read are executed in Dual Lane mode" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="Status command and read are executed in Single Lane mode" edc:when="(field &amp; 0x3) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="STATPOS" edc:desc="Statis Bit Position in Flash bit" edc:mask="0x1" edc:name="STATPOS" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:desc="BUSY bit position is bit 7 in status register" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="BUSY bit position is bit 0 in status register" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8E2064" edc:_begin="0x40" edc:_end="0x6c" edc:_modsrc="DOS-EIP-00206r5-sqi-v2.Module" edc:_refcount="2" edc:access="---nnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="SQI1XCON3" edc:desc="SQI XIP Control Register 3" edc:impl="0x1fffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000000000000000000000000000" edc:name="SQI1XCON3" edc:nzwidth="32" edc:por="---00000000000000000000000000000" ltx:memberofperipheral="SQI1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="INIT1CMD1" edc:desc="Flash Initialization Command 1 bits. First command of the Flash initialization." edc:mask="0xff" edc:name="INIT1CMD1" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="INIT1CMD2" edc:desc="Flash Initialization Command 2 bits. Second command of the Flash initialization." edc:mask="0xff" edc:name="INIT1CMD2" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="INIT1CMD3" edc:desc="Flash Initialization Command 3 bits. Third command of the Flash initialization." edc:mask="0xff" edc:name="INIT1CMD3" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="INIT1TYPE" edc:desc="Flash Initialization 1 Command Type bits" edc:mask="0x3" edc:name="INIT1TYPE" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:desc="Reserved" edc:when="(field &amp; 0x3) == 0x3"/>
              <edc:SFRFieldSemantic edc:desc="INIT1 commands are sent in Quad Lane mode" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:desc="INIT1 commands are sent in Dual Lane mode" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="INIT1 commadns are sent in Single Lane mode" edc:when="(field &amp; 0x3) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="INIT1COUNT" edc:desc="Flash Initialization 1 Command Count bits" edc:mask="0x3" edc:name="INIT1COUNT" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:desc="INIT1CMD3, INIT1CMD2, and INIT1CMD3 are sent." edc:when="(field &amp; 0x3) == 0x3"/>
              <edc:SFRFieldSemantic edc:desc="INIT1CMD1 and INIT1CMD2 are sent, but INIT1CMD3 is still pending." edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:desc="INIT1CMD1 is sent, but INIT1CMD2 and INIT1CMD3 are still pending." edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="No commands are sent" edc:when="(field &amp; 0x3) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="INIT1SCHECK" edc:desc="Flash Initialization 1 Command Status Check bit" edc:mask="0x1" edc:name="INIT1SCHECK" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:desc="Check the status after executing the INIT1 command" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="Do not check the status" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
