Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/1.0.64/edc/PIC32MZ2025DAR176.PIC
      <edc:AdjustPoint edc:_addr="0x1F8F8544" edc:offset="12"/>
      <edc:SFRDef edc:_addr="0x1F8F8550" edc:_begin="0x1c" edc:_end="0x20" edc:_modsrc="DOS-EIP-00136_ssx_v1.Module" edc:_refcount="35" edc:access="----------------------------nnnn" edc:cname="SBT1RD8" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------1111" edc:name="SBT1RD8" edc:nzwidth="32" edc:por="----------------------------1111" ltx:memberofperipheral="SB">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="GROUP0" edc:desc="" edc:mask="0x1" edc:name="GROUP0" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="GROUP1" edc:desc="" edc:mask="0x1" edc:name="GROUP1" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="GROUP2" edc:desc="" edc:mask="0x1" edc:name="GROUP2" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="GROUP3" edc:desc="" edc:mask="0x1" edc:name="GROUP3" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F8F8554" edc:offset="4"/>
      <edc:SFRDef edc:_addr="0x1F8F8558" edc:_begin="0x20" edc:_end="0x24" edc:_modsrc="DOS-EIP-00136_ssx_v1.Module" edc:_refcount="36" edc:access="----------------------------nnnn" edc:cname="SBT1WR8" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------1111" edc:name="SBT1WR8" edc:nzwidth="32" edc:por="----------------------------1111" ltx:memberofperipheral="SB">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="GROUP0" edc:desc="" edc:mask="0x1" edc:name="GROUP0" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="GROUP1" edc:desc="" edc:mask="0x1" edc:name="GROUP1" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="GROUP2" edc:desc="" edc:mask="0x1" edc:name="GROUP2" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="GROUP3" edc:desc="" edc:mask="0x1" edc:name="GROUP3" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F8F855C" edc:offset="708"/>
      <edc:SFRDef edc:_addr="0x1F8F8820" edc:_begin="0x4" edc:_end="0x10" edc:_modsrc="DOS-EIP-00136_ssx_v1.Module" edc:_refcount="37" edc:access="C---CCCC--------rrrrrrrrrrrr-rrr" edc:cname="SBT2ELOG1" edc:desc="" edc:impl="0x8f00fff7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0---0000--------000000000000-000" edc:name="SBT2ELOG1" edc:nzwidth="32" edc:por="0---0000--------000000000000-000" ltx:memberofperipheral="">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CMD" edc:desc="" edc:mask="0x7" edc:name="CMD" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="REGION" edc:desc="" edc:mask="0xf" edc:name="REGION" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="INITID" edc:desc="" edc:mask="0xff" edc:name="INITID" edc:nzwidth="8"/>
            <edc:AdjustPoint edc:offset="8"/>
            <edc:SFRFieldDef edc:cname="CODE" edc:desc="" edc:mask="0xf" edc:name="CODE" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="MULTI" edc:desc="" edc:mask="0x1" edc:name="MULTI" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8F8824" edc:_begin="0x4" edc:_end="0x10" edc:_modsrc="DOS-EIP-00136_ssx_v1.Module" edc:_refcount="37" edc:access="------------------------------rr" edc:cname="SBT2ELOG2" edc:desc="" edc:impl="0x3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------------------------00" edc:name="SBT2ELOG2" edc:nzwidth="32" edc:por="------------------------------00" ltx:memberofperipheral="">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="GROUP" edc:desc="" edc:mask="0x3" edc:name="GROUP" edc:nzwidth="2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8F8828" edc:_begin="0x4" edc:_end="0x10" edc:_modsrc="DOS-EIP-00136_ssx_v1.Module" edc:_refcount="37" edc:access="-------n------------------------" edc:cname="SBT2ECON" edc:desc="" edc:impl="0x1000000" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------0------------------------" edc:name="SBT2ECON" edc:nzwidth="32" edc:por="-------0------------------------" ltx:memberofperipheral="">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="24"/>
            <edc:SFRFieldDef edc:cname="ERRP" edc:desc="" edc:mask="0x1" edc:name="ERRP" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F8F882C" edc:offset="4"/>
      <edc:SFRDef edc:_addr="0x1F8F8830" edc:_begin="0x10" edc:_end="0x14" edc:_modsrc="DOS-EIP-00136_ssx_v1.Module" edc:_refcount="38" edc:access="-------------------------------r" edc:cname="SBT2ECLRS" edc:desc="" edc:impl="0x1" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------------------------------0" edc:name="SBT2ECLRS" edc:nzwidth="32" edc:por="-------------------------------0" ltx:memberofperipheral="">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CLEAR" edc:desc="" edc:mask="0x1" edc:name="CLEAR" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F8F8834" edc:offset="4"/>
      <edc:SFRDef edc:_addr="0x1F8F8838" edc:_begin="0x14" edc:_end="0x18" edc:_modsrc="DOS-EIP-00136_ssx_v1.Module" edc:_refcount="39" edc:access="-------------------------------r" edc:cname="SBT2ECLRM" edc:desc="" edc:impl="0x1" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------------------------------0" edc:name="SBT2ECLRM" edc:nzwidth="32" edc:por="-------------------------------0" ltx:memberofperipheral="">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CLEAR" edc:desc="" edc:mask="0x1" edc:name="CLEAR" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
